20230911073127-cryptanalysis_attacks.org
:PROPERTIES:
:ID:       0ab7f6ae-1672-465d-b6b0-a2c74cbd568d
:END:
#+title: Cryptanalysis Attacks

There are several types of attacks that [[id:2641c0d8-e9ac-47cf-a3a9-6be59696ceb4][hackers]] or security professionals employ to get data from a network using [[id:29235b07-ca3d-485e-b733-bf223a30b80e][Cryptanalysis]].
The attacks all use a different way into the network to gain encoded information and translate it from the encoded form into information that can be easily read.

* Types of cryptanalysis attack
** [[id:99de7aaa-e4d3-4aba-834f-12b6c9d4c19b][Known-Plaintext Analysis (KPA)]]
** [[id:453c694f-ed6a-44e6-8277-cdfdde743c23][Chosen-Plaintext Analysis (CPA)]]
** [[id:c6429b78-9076-4582-8dd2-65309d7e6c26][Ciphertext-Only Analysis (COA)]]
** [[id:f53e6b0e-fede-4f88-a03e-30530338e1ae][Adaptive Chosen-Plaintext Attack (ACPA)]]
** [[id:5e001451-ad10-47ba-b844-42002e5bb3ad][Meddler-in-the-Middle (MITM)]]

[[id:37b247e7-d20d-4e35-a0e7-05acd9261748][Cryptanalysis Attack Damages]]
