20230911073127-cryptanalysis_attacks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cryptanalysis Attacks</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Cryptanalysis Attacks</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org390f329">1. Types of cryptanalysis attack</a>
<ul>
<li><a href="#orgdddb0d4">1.1. Known-Plaintext Analysis (KPA)</a></li>
<li><a href="#orgea5d1b8">1.2. Chosen-Plaintext Analysis (CPA)</a></li>
<li><a href="#org504e9d8">1.3. Ciphertext-Only Analysis (COA)</a></li>
<li><a href="#orgf8edc03">1.4. Adaptive Chosen-Plaintext Attack (ACPA)</a></li>
<li><a href="#org38f725a">1.5. Meddler-in-the-Middle (MITM)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
There are several types of attacks that <a href="20230831063203-hacker.html#ID-2641c0d8-e9ac-47cf-a3a9-6be59696ceb4">hackers</a> or security professionals employ to get data from a network using <a href="20230911071902-cryptanalysis.html#ID-29235b07-ca3d-485e-b733-bf223a30b80e">Cryptanalysis</a>.
The attacks all use a different way into the network to gain encoded information and translate it from the encoded form into information that can be easily read.
</p>

<div id="outline-container-org390f329" class="outline-2">
<h2 id="org390f329"><span class="section-number-2">1.</span> Types of cryptanalysis attack</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdddb0d4" class="outline-3">
<h3 id="orgdddb0d4"><span class="section-number-3">1.1.</span> <a href="20230911073306-known_plaintext_analysis_kpa.html#ID-99de7aaa-e4d3-4aba-834f-12b6c9d4c19b">Known-Plaintext Analysis (KPA)</a></h3>
</div>
<div id="outline-container-orgea5d1b8" class="outline-3">
<h3 id="orgea5d1b8"><span class="section-number-3">1.2.</span> <a href="20230911073432-chosen_plaintext_analysis_cpa.html#ID-453c694f-ed6a-44e6-8277-cdfdde743c23">Chosen-Plaintext Analysis (CPA)</a></h3>
</div>
<div id="outline-container-org504e9d8" class="outline-3">
<h3 id="org504e9d8"><span class="section-number-3">1.3.</span> <a href="20230911073535-ciphertext_only_analysis_coa.html#ID-c6429b78-9076-4582-8dd2-65309d7e6c26">Ciphertext-Only Analysis (COA)</a></h3>
</div>
<div id="outline-container-orgf8edc03" class="outline-3">
<h3 id="orgf8edc03"><span class="section-number-3">1.4.</span> <a href="20230911073653-adaptive_chosen_plaintext_attack_acpa.html#ID-f53e6b0e-fede-4f88-a03e-30530338e1ae">Adaptive Chosen-Plaintext Attack (ACPA)</a></h3>
</div>
<div id="outline-container-org38f725a" class="outline-3">
<h3 id="org38f725a"><span class="section-number-3">1.5.</span> <a href="20230911073754-meddler_in_the_middle_mitm.html#ID-5e001451-ad10-47ba-b844-42002e5bb3ad">Meddler-in-the-Middle (MITM)</a></h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="20230911073940-cryptanalysis_attack_damages.html#ID-37b247e7-d20d-4e35-a0e7-05acd9261748">Cryptanalysis Attack Damages</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
